{
  "posts": [
    {
      "id": "1",
      "title": "json-server",
      "userId": "1"
    },
    {
      "id": "2",
      "title": "json-server",
      "userId": "2"
    }
  ],
  "notifications": [
    {
      "id": "1",
      "title": "Уведомление 1",
      "description": "Произошло какое-то событие",
      "userId": "1"
    },
    {
      "id": "2",
      "title": "Уведомление 2",
      "description": "Произошло какое-то событие",
      "userId": "1",
      "href": "http://localhost:3000/admin"
    },
    {
      "id": "3",
      "title": "Уведомление 3",
      "description": "Произошло какое-то событие",
      "userId": "1",
      "href": "http://localhost:3000/admin"
    },
    {
      "id": "4",
      "title": "Уведомление 4",
      "description": "Произошло какое-то событие",
      "userId": "1"
    },
    {
      "id": "5",
      "title": "Уведомление 1",
      "description": "Произошло какое-то событие",
      "userId": "2"
    }
  ],
  "articles": [
    {
      "id": "1",
      "title": "Javascript news",
      "subtitle": "Что нового в JS за 2022 год?",
      "img": "https://teknotower.com/wp-content/uploads/2020/11/js.png",
      "views": 1990,
      "createdAt": "02.02.2022",
      "userId": "1",
      "type": [
        "IT"
      ],
      "blocks": [
        {
          "id": "1",
          "type": "TEXT",
          "title": "Заголовок этого блока",
          "paragraphs": [
            "Программа, которую по традиции называют «Hello, world!», очень проста. Она выводит куда-либо фразу «Hello, world!», или другую подобную, средствами некоего языка.",
            "JavaScript — это язык, программы на котором можно выполнять в разных средах. В нашем случае речь идёт о браузерах и о серверной платформе Node.js. Если до сих пор вы не написали ни строчки кода на JS и читаете этот текст в браузере, на настольном компьютере, это значит, что вы буквально в считанных секундах от своей первой JavaScript-программы.",
            "Существуют и другие способы запуска JS-кода в браузере. Так, если говорить об обычном использовании программ на JavaScript, они загружаются в браузер для обеспечения работы веб-страниц. Как правило, код оформляют в виде отдельных файлов с расширением .js, которые подключают к веб-страницам, но программный код можно включать и непосредственно в код страницы. Всё это делается с помощью тега <script>. Когда браузер обнаруживает такой код, он выполняет его. Подробности о теге script можно посмотреть на сайте w3school.com. В частности, рассмотрим пример, демонстрирующий работу с веб-страницей средствами JavaScript, приведённый на этом ресурсе. Этот пример можно запустить и средствами данного ресурса (ищите кнопку Try it Yourself), но мы поступим немного иначе. А именно, создадим в каком-нибудь текстовом редакторе (например — в VS Code или в Notepad++) новый файл, который назовём hello.html, и добавим в него следующий код:"
          ]
        },
        {
          "id": "4",
          "type": "CODE",
          "code": "<!DOCTYPE html>\n<html>\n  <body>\n    <p id=\"hello\"></p>\n\n    <script>\n      document.getElementById(\"hello\").innerHTML = \"Hello, world!\";\n    </script>\n  </body>\n</html>;"
        },
        {
          "id": "5",
          "type": "TEXT",
          "title": "Заголовок этого блока",
          "paragraphs": [
            "Программа, которую по традиции называют «Hello, world!», очень проста. Она выводит куда-либо фразу «Hello, world!», или другую подобную, средствами некоего языка.",
            "Существуют и другие способы запуска JS-кода в браузере. Так, если говорить об обычном использовании программ на JavaScript, они загружаются в браузер для обеспечения работы веб-страниц. Как правило, код оформляют в виде отдельных файлов с расширением .js, которые подключают к веб-страницам, но программный код можно включать и непосредственно в код страницы. Всё это делается с помощью тега <script>. Когда браузер обнаруживает такой код, он выполняет его. Подробности о теге script можно посмотреть на сайте w3school.com. В частности, рассмотрим пример, демонстрирующий работу с веб-страницей средствами JavaScript, приведённый на этом ресурсе. Этот пример можно запустить и средствами данного ресурса (ищите кнопку Try it Yourself), но мы поступим немного иначе. А именно, создадим в каком-нибудь текстовом редакторе (например — в VS Code или в Notepad++) новый файл, который назовём hello.html, и добавим в него следующий код:"
          ]
        },
        {
          "id": "2",
          "type": "IMAGE",
          "src": "https://hsto.org/r/w1560/getpro/habr/post_images/d56/a02/ffc/d56a02ffc62949b42904ca00c63d8cc1.png",
          "title": "Рисунок 1 - скриншот сайта"
        },
        {
          "id": "3",
          "type": "CODE",
          "code": "const path = require('path');\n\nconst server = jsonServer.create();\n\nconst router = jsonServer.router(path.resolve(__dirname, 'db.json'));\n\nserver.use(jsonServer.defaults({}));\nserver.use(jsonServer.bodyParser);"
        },
        {
          "id": "7",
          "type": "TEXT",
          "title": "Заголовок этого блока",
          "paragraphs": [
            "JavaScript — это язык, программы на котором можно выполнять в разных средах. В нашем случае речь идёт о браузерах и о серверной платформе Node.js. Если до сих пор вы не написали ни строчки кода на JS и читаете этот текст в браузере, на настольном компьютере, это значит, что вы буквально в считанных секундах от своей первой JavaScript-программы.",
            "Существуют и другие способы запуска JS-кода в браузере. Так, если говорить об обычном использовании программ на JavaScript, они загружаются в браузер для обеспечения работы веб-страниц. Как правило, код оформляют в виде отдельных файлов с расширением .js, которые подключают к веб-страницам, но программный код можно включать и непосредственно в код страницы. Всё это делается с помощью тега <script>. Когда браузер обнаруживает такой код, он выполняет его. Подробности о теге script можно посмотреть на сайте w3school.com. В частности, рассмотрим пример, демонстрирующий работу с веб-страницей средствами JavaScript, приведённый на этом ресурсе. Этот пример можно запустить и средствами данного ресурса (ищите кнопку Try it Yourself), но мы поступим немного иначе. А именно, создадим в каком-нибудь текстовом редакторе (например — в VS Code или в Notepad++) новый файл, который назовём hello.html, и добавим в него следующий код:"
          ]
        },
        {
          "id": "8",
          "type": "IMAGE",
          "src": "https://hsto.org/r/w1560/getpro/habr/post_images/d56/a02/ffc/d56a02ffc62949b42904ca00c63d8cc1.png",
          "title": "Рисунок 1 - скриншот сайта"
        },
        {
          "id": "9",
          "type": "TEXT",
          "title": "Заголовок этого блока",
          "paragraphs": [
            "JavaScript — это язык, программы на котором можно выполнять в разных средах. В нашем случае речь идёт о браузерах и о серверной платформе Node.js. Если до сих пор вы не написали ни строчки кода на JS и читаете этот текст в браузере, на настольном компьютере, это значит, что вы буквально в считанных секундах от своей первой JavaScript-программы."
          ]
        }
      ]
    },
    {
      "id": "2",
      "title": "Python news",
      "subtitle": "Что нового в JS за 2022 год?",
      "img": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c3/Python-logo-notext.svg/1200px-Python-logo-notext.svg.png",
      "views": 10,
      "createdAt": "16.05.2021",
      "userId": "1",
      "type": [
        "IT"
      ],
      "blocks": [
        {
          "id": "1",
          "type": "TEXT",
          "title": "Заголовок этого блока",
          "paragraphs": [
            "Python в русском языке встречаются названия пито́н[23] или па́йтон[24]) — высокоуровневый язык программирования общего назначения с динамической строгой типизацией и автоматическим управлением памятью[25][26], ориентированный на повышение производительности разработчика, читаемости кода и его качества, а также на обеспечение переносимости написанных на нём программ[27]. Язык является полностью объектно-ориентированным в том плане, что всё является объектами[",
            "Синтаксис ядра языка минималистичен, за счёт чего на практике редко возникает необходимость обращаться к документации[27]. Сам же язык известен как интерпретируемый и используется в том числе для написания скриптов[25]. Недостатками языка являются зачастую более низкая скорость работы и более высокое потребление памяти написанных на нём программ по сравнению с аналогичным кодом, написанным на компилируемых языках, таких как C или C++[",
            "Python является мультипарадигменным языком программирования, поддерживающим императивное, процедурное, структурное, объектно-ориентированное программирование[25], метапрограммирование[29] и функциональное программирование[25]. Задачи обобщённого программирования решаются за счёт динамической типизации[30][31]. Аспектно-ориентированное программирование частично поддерживается через декораторы[32], более полноценная поддержка обеспечивается дополнительными фреймворками[33]. Такие методики как контрактное и логическое программирование можно реализовать с помощью библиотек или расширений[34]. Основные архитектурные черты — динамическая типизация, автоматическое управление памятью[25], полная интроспекция, механизм обработки исключений, поддержка многопоточных вычислений с глобальной блокировкой интерпретатора (GIL)[35], высокоуровневые структуры данных. Поддерживается разбиение программ на модули, которые, в свою очередь, могут объединяться в пакеты"
          ]
        }
      ]
    },
    {
      "id": "3",
      "title": "Kotlin news",
      "subtitle": "Что нового в JS за 2022 год?",
      "img": "https://media.tproger.ru/uploads/2018/06/kotlin-vs-java-mini.png",
      "views": 99,
      "createdAt": "01.11.1999",
      "userId": "1",
      "type": [
        "IT"
      ],
      "blocks": [
        {
          "id": "1",
          "type": "TEXT",
          "title": "Заголовок этого блока",
          "paragraphs": [
            "Kotlin (Ко́тлин) — статически типизированный, объектно-ориентированный язык программирования, работающий поверх Java Virtual Machine и разрабатываемый компанией JetBrains. Также компилируется в JavaScript и в исполняемый код ряда платформ через инфраструктуру LLVM. Язык назван в честь острова Котлин в Финском заливе, на котором расположен город Кронштадт[4].",
            "Авторы ставили целью создать язык более лаконичный и типобезопасный, чем Java, и более простой, чем Scala[4]. Следствием упрощения по сравнению со Scala стали также более быстрая компиляция и лучшая поддержка языка в IDE[5]. Язык полностью совместим с Java, что позволяет Java-разработчикам постепенно перейти к его использованию; в частности, язык также встраивается Android, что позволяет для существующего Android-приложения внедрять новые функции на Kotlin без переписывания приложения целиком.",
            "Язык разрабатывается с 2010 года под руководством Андрея Бреслава[6][7], представлен общественности в июле 2011[8]. Исходный код реализации языка открыт в феврале 2012[9]. В феврале выпущен milestone 1, включающий плагин для IDEA. В июне — milestone 2 с поддержкой Android[10]. В декабре 2012 года вышел milestone 4, включающий, в частности, поддержку Java 7[11]."
          ]
        }
      ]
    },
    {
      "id": "4",
      "title": "Typescript news",
      "subtitle": "Что нового в JS за 2022 год?",
      "img": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4c/Typescript_logo_2020.svg/1024px-Typescript_logo_2020.svg.png",
      "views": 1229,
      "createdAt": "26.02.2023",
      "userId": "1",
      "type": [
        "IT"
      ],
      "blocks": [
        {
          "id": "1",
          "type": "TEXT",
          "title": "Заголовок этого блока",
          "paragraphs": [
            "TypeScript — язык программирования, представленный Microsoft в 2012 году и позиционируемый как средство разработки веб-приложений, расширяющее возможности JavaScript",
            "TypeScript является обратно совместимым с JavaScript и компилируется в последний. Фактически, после компиляции программу на TypeScript можно выполнять в любом современном браузере или использовать совместно с серверной платформой Node.js. Код экспериментального компилятора, транслирующего TypeScript в JavaScript, распространяется под лицензией Apache. Его разработка ведётся в публичном репозитории через сервис GitHub",
            "На момент релиза представлены файлы для восприятия расширенного синтаксиса TypeScript для Vim и Emacs, а также плагин для Microsoft Visual Studio"
          ]
        }
      ]
    },
    {
      "id": "5",
      "title": "Go news",
      "subtitle": "Что нового в JS за 2022 год?",
      "img": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/05/Go_Logo_Blue.svg/1920px-Go_Logo_Blue.svg.png",
      "views": 875,
      "createdAt": "23.07.2003",
      "userId": "1",
      "type": [
        "IT"
      ],
      "blocks": [
        {
          "id": "1",
          "type": "TEXT",
          "title": "Заголовок этого блока",
          "paragraphs": [
            "Go (часто также golang) — компилируемый многопоточный язык программирования, разработанный внутри компании Google[8]. Разработка Go началась в сентябре 2007 года, его непосредственным проектированием занимались Роберт Гризмер, Роб Пайк и Кен Томпсон[9], занимавшиеся до этого проектом разработки операционной системы Inferno.",
            "Официально язык был представлен в ноябре 2009 года. На данный момент поддержка официального компилятора, разрабатываемого создателями языка, осуществляется для операционных систем FreeBSD, OpenBSD, Linux, macOS, Windows, DragonFly BSD, Plan 9, Solaris, Android, AIX.[10]. Также Go поддерживается набором компиляторов gcc, существует несколько независимых реализаций.",
            "Название языка, выбранное компанией Google, практически совпадает с названием языка программирования Go!, созданного Ф. Джи. Маккейбом и К. Л. Кларком в 2003 году[11]. Обсуждение названия ведётся на странице, посвящённой Go[11]. На домашней странице языка и вообще в Интернет-публикациях часто используется альтернативное название — «golang»."
          ]
        }
      ]
    },
    {
      "id": "6",
      "title": "Java news",
      "subtitle": "Что нового в JS за 2022 год?",
      "img": "https://upload.wikimedia.org/wikipedia/ru/thumb/3/39/Java_logo.svg/234px-Java_logo.svg.png?20230113103550",
      "views": 1349,
      "createdAt": "04.08.2013",
      "userId": "1",
      "type": [
        "IT"
      ],
      "blocks": [
        {
          "id": "1",
          "type": "TEXT",
          "title": "Заголовок этого блока",
          "paragraphs": [
            "Java[прим. 1] — строго типизированный объектно-ориентированный язык программирования общего назначения, разработанный компанией Sun Microsystems (в последующем приобретённой компанией Oracle). Разработка ведётся сообществом, организованным через Java Community Process; язык и основные реализующие его технологии распространяются по лицензии GPL. Права на торговую марку принадлежат корпорации Oracle.",
            "Приложения Java обычно транслируются в специальный байт-код, поэтому они могут работать на любой компьютерной архитектуре, для которой существует реализация виртуальной Java-машины. Дата официального выпуска — 23 мая 1995 года. Занимает высокие места в рейтингах популярности языков программирования (2-е место в рейтингах IEEE Spectrum (2020)[3] и TIOBE (2021)[4]).",
            "Изначально язык назывался Oak («Дуб»), разрабатывался Джеймсом Гослингом для программирования бытовых электронных устройств. Из-за того, что язык с таким названием уже существовал, Oak был переименован в Java[5]. Назван в честь марки кофе Java, которая, в свою очередь, получила наименование одноимённого острова (Ява), поэтому на официальной эмблеме языка изображена чашка с горячим кофе. Существует и другая версия происхождения названия языка, связанная с аллюзией на кофемашину как пример бытового устройства, для программирования которого изначально язык создавался. В соответствии с этимологией в русскоязычной литературе с конца двадцатого и до первых лет двадцать первого века название языка нередко переводилось как Ява, а не транскрибировалось."
          ]
        }
      ]
    },
    {
      "id": "7",
      "title": "PHP news",
      "subtitle": "Что нового в JS за 2022 год?",
      "img": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/27/PHP-logo.svg/149px-PHP-logo.svg.png",
      "views": 225,
      "createdAt": "05.07.2003",
      "userId": "1",
      "type": [
        "IT"
      ],
      "blocks": [
        {
          "id": "1",
          "type": "TEXT",
          "title": "Заголовок этого блока",
          "paragraphs": [
            "PHP (/pi:.eɪtʃ.pi:/ англ. PHP: Hypertext Preprocessor — «PHP: препроцессор гипертекста»; первоначально PHP/FI (Personal Home Page / Form Interpreter), а позже названный Personal Home Page Tools[11] — «Инструменты для создания персональных веб-страниц») — C-подобный скриптовый язык[12] общего назначения, интенсивно применяемый для разработки веб-приложений. В настоящее время поддерживается подавляющим большинством хостинг-провайдеров и является одним из лидеров среди языков, применяющихся для создания динамических веб-сайтов[13].",
            "Язык и его интерпретатор (Zend Engine) разрабатываются группой энтузиастов в рамках проекта с открытым кодом[14]. Проект распространяется под собственной лицензией, несовместимой с GNU GPL.",
            "В области веб-программирования, в частности, серверной части, PHP — один из популярных сценарных языков (наряду с JSP, Perl и языками, используемыми в ASP.NET). Популярность в области построения веб-сайтов определяется наличием большого набора встроенных средств и дополнительных модулей для разработки веб-приложений[15]. Основные из них: Автоматическое извлечение POST- и GET-параметров, а также переменных окружения веб-сервера в предопределённые массивы;"
          ]
        }
      ]
    },
    {
      "id": "8",
      "title": "C#  news",
      "subtitle": "Что нового в JS за 2022 год?",
      "img": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0d/C_Sharp_wordmark.svg/80px-C_Sharp_wordmark.svg.png",
      "views": 84,
      "createdAt": "08.11.2022",
      "userId": "1",
      "type": [
        "IT"
      ],
      "blocks": [
        {
          "id": "1",
          "type": "TEXT",
          "title": "Заголовок этого блока",
          "paragraphs": [
            "C# (произносится си шарп) — объектно-ориентированный язык программирования общего назначения. Разработан в 1998—2001 годах группой инженеров компании Microsoft под руководством Андерса Хейлсберга и Скотта Вильтаумота[6] как язык разработки приложений для платформы Microsoft .NET Framework и .NET Core. Впоследствии был стандартизирован как ECMA-334 и ISO/IEC 23270.",
            "C# относится к семье языков с C-подобным синтаксисом, из них его синтаксис наиболее близок к C++ и Java. Язык имеет статическую типизацию, поддерживает полиморфизм, перегрузку операторов (в том числе операторов явного и неявного приведения типа), делегаты, атрибуты, события, переменные, свойства, обобщённые типы и методы, итераторы, анонимные функции с поддержкой замыканий, LINQ, исключения, комментарии в формате XML.",
            "Переняв многое от своих предшественников — языков C++, Delphi, Модула, Smalltalk и, в особенности, Java — С#, опираясь на практику их использования, исключает некоторые модели, зарекомендовавшие себя как проблематичные при разработке программных систем, например, C# в отличие от C++ не поддерживает множественное наследование классов (между тем допускается множественная реализация интерфейсов)."
          ]
        }
      ]
    },
    {
      "id": "9",
      "title": "Swift news",
      "subtitle": "Что нового в JS за 2022 год?",
      "img": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9d/Swift_logo.svg/220px-Swift_logo.svg.png",
      "views": 563,
      "createdAt": "19.01.2014",
      "userId": "1",
      "type": [
        "IT"
      ],
      "blocks": [
        {
          "id": "1",
          "type": "TEXT",
          "title": "Заголовок этого блока",
          "paragraphs": [
            "Swift — открытый мультипарадигмальный компилируемый язык программирования общего назначения, разработанный и поддерживаемый компанией Apple. Первая версия была представлена в 2014 году.",
            "Чаще всего Swift используется в разработке приложений для macOS, iOS, iPadOS, watchOS и tvOS, однако язык также доступен для Windows и Linux. На платформах Apple язык работает с фреймворками Cocoa и Cocoa Touch и совместим с основной кодовой базой Apple, написанной на более раннем языке Objective-C. Swift задумывался как более лёгкий для чтения и устойчивый к ошибкам программиста язык: существенная часть проблем, которые в случае с Objective-C обнаруживаются только при исполнении программ и приводят к крэшам, в Swift в принципе не позволят скомпилировать код[7].",
            "Компилятор Swift работает на базе LLVM, в результате чего один и тот же код может быть скомпилирован для различных платформ: x86, ARM, WASM и других. Набор инструментов (toolchain) для работы с языком встроен в интегрированную среду разработки Xcode 6 и выше. Swift может использовать рантайм Objective-C, что делает возможным использование обоих языков (а также языка Си) в рамках одной программы."
          ]
        }
      ]
    },
    {
      "id": "10",
      "title": "Ruby news",
      "subtitle": "Что нового в JS за 2022 год?",
      "img": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/73/Ruby_logo.svg/80px-Ruby_logo.svg.png",
      "views": 541,
      "createdAt": "15.03.1995",
      "userId": "1",
      "type": [
        "IT"
      ],
      "blocks": [
        {
          "id": "1",
          "type": "TEXT",
          "title": "Заголовок этого блока",
          "paragraphs": [
            "Ruby (англ. ruby — рубин, произносится ['ru:bɪ] — ру́би) — динамический, рефлективный, интерпретируемый высокоуровневый язык программирования[8][9]. Язык обладает независимой от операционной системы реализацией многопоточности, сильной динамической типизацией, сборщиком мусора и многими другими возможностями[⇨]. По особенностям синтаксиса он близок к языкам Perl и Eiffel, по объектно-ориентированному подходу — к Smalltalk. Также некоторые черты языка взяты из Python, Lisp, Dylan и Клу.",
            "Создатель Ruby — Юкихиро Мацумото (Matz) — интересовался языками программирования, ещё будучи студентом, но идея о разработке нового языка появилась позже. Ruby начал разрабатываться 23 февраля 1993 года и вышел в свет в 1995 году.",
            "В Японии Ruby стал популярным с момента появления первой общедоступной версии в 1995 году, однако наличие документации только на японском языке сдерживало его дальнейшее распространение. Лишь в 1997 году появилось описание Ruby на английском языке, а в 1998 году открылся форум «ruby-talk». Это положило начало росту известности языка в остальном мире. В начале 2000-х вышло несколько книг на английском языке, что способствовало росту популярности Ruby в Западной Европе и Америке. В 2003 году была выпущена версия Ruby 1.8.0, а в 2005 году появился веб-фреймворк Ruby on Rails, написанный на Ruby и сразу завоевавший признание благодаря лёгкости построения на нём типичных веб-приложений. Ruby в нём является не только языком реализации самого фреймворка, но и языком описания решений (в частности, используются HTML-шаблоны с встроенным кодом на Ruby)."
          ]
        }
      ]
    },
    {
      "id": "11",
      "title": "C++ news",
      "subtitle": "Что нового в JS за 2022 год?",
      "img": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/18/ISO_C%2B%2B_Logo.svg/71px-ISO_C%2B%2B_Logo.svg.png",
      "views": 1255,
      "createdAt": "31.06.1983",
      "userId": "1",
      "type": [
        "IT"
      ],
      "blocks": [
        {
          "id": "1",
          "type": "TEXT",
          "title": "Заголовок этого блока",
          "paragraphs": [
            "C++ (читается си-плюс-плюс[2][3]) — компилируемый, статически типизированный язык программирования общего назначения.",
            "Поддерживает такие парадигмы программирования, как процедурное программирование, объектно-ориентированное программирование, обобщённое программирование. Язык имеет богатую стандартную библиотеку, которая включает в себя распространённые контейнеры и алгоритмы, ввод-вывод, регулярные выражения, поддержку многопоточности и другие возможности. C++ сочетает свойства как высокоуровневых, так и низкоуровневых языков[4][5]. В сравнении с его предшественником — языком C — наибольшее внимание уделено поддержке объектно-ориентированного и обобщённого программирования[5]",
            "C++ широко используется для разработки программного обеспечения, являясь одним из самых популярных языков программирования[мнения 1][мнения 2]. Область его применения включает создание операционных систем, разнообразных прикладных программ, драйверов устройств, приложений для встраиваемых систем, высокопроизводительных серверов, а также компьютерных игр. Существует множество реализаций языка C++, как бесплатных, так и коммерческих и для различных платформ. Например, на платформе x86 это GCC, Visual C++, Intel C++ Compiler, Embarcadero (Borland) C++ Builder и другие. C++ оказал огромное влияние на другие языки программирования, в первую очередь на Java и C#. Синтаксис C++ унаследован от языка C. Изначально одним из принципов разработки было сохранение совместимости с C. Тем не менее C++ не является в строгом смысле надмножеством C; множество программ, которые могут одинаково успешно транслироваться как компиляторами C, так и компиляторами C++, довольно велико, но не включает все возможные программы на C"
          ]
        }
      ]
    },
    {
      "id": "12",
      "title": "MATLAB news",
      "subtitle": "Что нового в JS за 2022 год?",
      "img": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/21/Matlab_Logo.png/89px-Matlab_Logo.png",
      "views": 1982,
      "createdAt": "18.03.2022",
      "userId": "1",
      "type": [
        "IT"
      ],
      "blocks": [
        {
          "id": "1",
          "type": "TEXT",
          "title": "Заголовок этого блока",
          "paragraphs": [
            "MATLAB (сокращение от англ. «Matrix Laboratory», в русском языке произносится как Матла́б) — пакет прикладных программ для решения задач технических вычислений. Пакет используют более миллиона инженерных и научных работников, он работает на большинстве современных операционных систем, включая Linux, macOS, Solaris (начиная с версии R2010b поддержка Solaris прекращена[8][9]) и Windows[10]",
            "MATLAB как язык программирования был разработан Кливом Моулером (англ. Cleve Moler) в конце 1970-х годов, когда он был деканом факультета компьютерных наук в Университете Нью-Мексико. Целью разработки служила задача дать студентам факультета возможность использования программных библиотек Linpack и EISPACK без необходимости изучения Фортрана. Вскоре новый язык распространился среди других университетов и был с большим интересом встречен учёными, работающими в области прикладной математики. ",
            "До сих пор в Интернете можно найти версию 1982 года, написанную на Фортране, распространяемую с открытым исходным кодом. Инженер Джон Литтл (англ. John N. (Jack) Little) познакомился с этим языком во время визита Клива Моулера в Стэнфордский университет в 1983 году. Поняв, что новый язык обладает большим коммерческим потенциалом, он объединился с Кливом Моулером и Стивом Бангертом (англ. Steve Bangert)[11]. Совместными усилиями они переписали MATLAB на C[12] и основали в 1984 компанию The MathWorks для дальнейшего развития. Эти переписанные на С библиотеки долгое время были известны под именем JACKPAC. Первоначально MATLAB предназначался для проектирования систем управления (основная специальность Джона Литтла), но быстро завоевал популярность во многих других научных и инженерных областях. Он также широко использовался и в образовании, в частности, для преподавания линейной алгебры и численных методов."
          ]
        }
      ]
    },
    {
      "id": "13",
      "title": "Scala news",
      "subtitle": "Что нового в JS за 2022 год?",
      "img": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/39/Scala-full-color.svg/176px-Scala-full-color.svg.png",
      "views": 208,
      "createdAt": "20.01.2004",
      "userId": "1",
      "type": [
        "IT"
      ],
      "blocks": [
        {
          "id": "1",
          "type": "TEXT",
          "title": "Заголовок этого блока",
          "paragraphs": [
            "Scala — мультипарадигмальный язык программирования, спроектированный кратким и типобезопасным для простого и быстрого создания компонентного программного обеспечения, сочетающий возможности функционального и объектно-ориентированного программирования.",
            "Первые версии языка созданы в 2003 году коллективом лаборатории методов программирования Федеральной политехнической школы Лозанны под руководством Мартина Одерски, язык реализован для платформ Java и JavaScript. По мнению Джеймса Стрэчена[en], создателя языка программирования Groovy, Scala может стать преемником языка Java[5].",
            "Язык был создан в 2001—2004 годах в Лаборатории методов программирования EPFL. Он стал результатом исследований, направленных на разработку улучшенной языковой поддержки компонентного программного обеспечения. За основу при разработке языка были взяты две идеи: Язык программирования компонентного ПО должен быть масштабируемым в том смысле, что должна быть возможность с помощью одних и тех же концепций описать как маленькие, так и большие части. Поэтому внимание было сконцентрировано на механизмах абстракции, композиции и декомпозиции вместо введения большого количества примитивов, которые могут быть полезными только на каком-то одном уровне масштабирования. Масштабируемая поддержка компонентов может быть предоставлена языком программирования, унифицирующим и обобщающим объектно-ориентированное и функциональное программирование. Некоторые из основных технических новшеств Scala — это концепции, представляющие собой сплав этих парадигм программирования. В статически типизированных языках, к которым относится Scala, эти парадигмы до сих пор были почти полностью разделены."
          ]
        }
      ]
    },
    {
      "id": "14",
      "title": "SQL news",
      "subtitle": "Что нового в JS за 2022 год?",
      "img": "https://upload.wikimedia.org/wikipedia/commons/6/6f/Sql_database_shortcut_icon.png",
      "views": 234,
      "createdAt": "26.05.2000",
      "userId": "1",
      "type": [
        "IT"
      ],
      "blocks": [
        {
          "id": "1",
          "type": "TEXT",
          "title": "Заголовок этого блока",
          "paragraphs": [
            "SQL (МФА: [ˈɛsˈkjuˈɛl]; аббр. от англ. Structured Query Language — «язык структурированных запросов») — декларативный язык программирования, применяемый для создания, модификации и управления данными в реляционной базе данных, управляемой соответствующей системой управления базами данных.",
            "Является, прежде всего, информационно-логическим языком, предназначенным для описания, изменения и извлечения данных, хранимых в реляционных базах данных. В общем случае SQL (без ряда современных расширений) считается языком программирования неполным по Тьюрингу, но вместе с тем стандарт языка спецификацией SQL/PSM предусматривает возможность его процедурных расширений.",
            "Изначально SQL был основным способом работы пользователя с базой данных и позволял выполнять следующий набор операций: создание в базе данных новой таблицы; добавление в таблицу новых записей; изменение записей; удаление записей; выборка записей из одной или нескольких таблиц (в соответствии с заданным условием); изменение структур таблиц."
          ]
        }
      ]
    },
    {
      "id": "15",
      "title": "HTML news",
      "subtitle": "Что нового в HTML?",
      "img": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/61/HTML5_logo_and_wordmark.svg/80px-HTML5_logo_and_wordmark.svg.png",
      "views": 10100,
      "createdAt": "20.10.1993",
      "userId": "1",
      "type": [
        "IT"
      ],
      "blocks": [
        {
          "id": "1",
          "type": "TEXT",
          "title": "Заголовок этого блока",
          "paragraphs": [
            "HTML (от англ. HyperText Markup Language — «язык гипертекстовой разметки») — стандартизированный язык гипертекстовой разметки документов для просмотра веб-страниц в браузере. Веб-браузеры получают HTML документ от сервера по протоколам HTTP/HTTPS или открывают с локального диска, далее интерпретируют код в интерфейс, который будет отображаться на экране монитора.",
            "Элементы HTML являются строительными блоками HTML страниц. С помощью HTML разные конструкции, изображения и другие объекты, такие как интерактивная веб-форма, могут быть встроены в отображаемую страницу. HTML предоставляет средства для создания заголовков, абзацев, списков, ссылок, цитат и других элементов. Элементы HTML выделяются тегами, записанными с использованием угловых скобок. Такие теги, как <img /> и <input />, напрямую вводят контент на страницу. Другие теги, такие как <p>, окружают и оформляют текст внутри себя и могут включать другие теги в качестве подэлементов. Браузеры не отображают HTML-теги, но используют их для интерпретации содержимого страницы.",
            "Язык гипертекстовой разметки HTML был разработан британским учёным Тимом Бернерсом-Ли приблизительно в 1986—1991 годах в стенах ЦЕРНа в Женеве в Швейцарии[3]. HTML создавался как язык для обмена научной и технической документацией, пригодный для использования людьми, не являющимися специалистами в области вёрстки. HTML успешно справлялся с проблемой сложности SGML путём определения небольшого набора структурных и семантических элементов — дескрипторов. Дескрипторы также часто называют «тегами». С помощью HTML можно легко создать относительно простой, но красиво оформленный документ. Помимо упрощения структуры документа, в HTML внесена поддержка гипертекста. Мультимедийные возможности были добавлены позже."
          ]
        }
      ]
    },
    {
      "id": "16",
      "title": "CSS news",
      "subtitle": "Что нового в CSS?",
      "img": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/62/CSS3_logo.svg/80px-CSS3_logo.svg.png",
      "views": 17120,
      "createdAt": "27.05.1996",
      "userId": "1",
      "type": [
        "IT"
      ],
      "blocks": [
        {
          "id": "1",
          "type": "TEXT",
          "title": "Заголовок этого блока",
          "paragraphs": [
            "CSS (/siːɛsɛs/ англ. Cascading Style Sheets «каскадные таблицы стилей») — формальный язык описания внешнего вида документа (веб-страницы), написанного с использованием языка разметки (чаще всего HTML или XHTML). Также может применяться к любым XML-документам, например, к SVG или XUL.",
            "CSS используется создателями веб-страниц для задания цветов, шрифтов, стилей, расположения отдельных блоков и других аспектов представления внешнего вида этих веб-страниц. Основной целью разработки CSS является ограждение и отделение описания логической структуры веб-страницы (которое производится с помощью HTML или других языков разметки) от описания внешнего вида этой веб-страницы (которое теперь производится с помощью формального языка CSS). Такое разделение может увеличить доступность документа, предоставить большую гибкость и возможность управления его представлением, а также уменьшить сложность и повторяемость в структурном содержимом.",
            "Кроме того, CSS позволяет представлять один и тот же документ в различных стилях или методах вывода, таких как экранное представление, печатное представление, чтение голосом (специальным голосовым браузером или программой чтения с экрана) или при выводе устройствами, использующими шрифт Брайля"
          ]
        }
      ]
    },
    {
      "id": "17",
      "title": "Rust news",
      "subtitle": "Что нового в Rust?",
      "img": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d5/Rust_programming_language_black_logo.svg/80px-Rust_programming_language_black_logo.svg.png",
      "views": 1022,
      "createdAt": "23.03.2012",
      "userId": "1",
      "type": [
        "IT"
      ],
      "blocks": [
        {
          "id": "1",
          "type": "TEXT",
          "title": "Заголовок этого блока",
          "paragraphs": [
            "Rust (Раст, [rʌst]; rust с англ. — «ржавчина») — мультипарадигменный компилируемый язык программирования общего назначения, сочетающий парадигмы функционального и процедурного программирования с объектной системой, основанной на типажах. Управление памятью осуществляется через механизм «владения» с использованием аффинных типов[en][10], что позволяет обходиться без системы сборки мусора во время исполнения программы. Rust гарантирует безопасную работу с памятью благодаря встроенной в компилятор системе статической проверки ссылок (borrow checker). Имеются средства, позволяющие использовать приёмы объектно-ориентированного программирования[11].",
            "Ключевые приоритеты языка: безопасность, скорость и параллелизм. Rust пригоден для системного программирования, в частности, он рассматривается как перспективный язык для разработки ядер операционных систем[10]. Rust сопоставим по скорости и возможностям с C++/Си, однако даёт большую безопасность при работе с памятью, что обеспечивается встроенными в язык механизмами контроля ссылок. Производительности программ на Rust способствует использование «абстракций с нулевой стоимостью»[12].",
            "После нескольких лет активной разработки первая стабильная версия (1.0) вышла 15 мая 2015 года, после чего новые версии выходят раз в 6 недель[13]. Для версий языка, вышедших после 1.0, заявлена обратная совместимость[14]. Разрабатывается с 2010-х годов сообществом Mozilla Research и финансируется фондом Mozilla Foundation. С 2020 года планировалась передача интеллектуальной собственности и процессов развития и финансирования языка в организацию Rust Foundation[15]. 8 февраля 2021 года пять компаний-учредителей (AWS, Huawei, Google, Microsoft и Mozilla) официально объявили о создании Rust Foundation.[16][17] Семь лет подряд с 2016 по 2022 год Rust занимает первое место в списке самых любимых языков программирования («Most loved programming languages») по версии ежегодного опроса разработчиков Stack Overflow Developer Survey["
          ]
        }
      ]
    },
    {
      "id": "18",
      "title": "Матема́тика news",
      "subtitle": "Матема́тика за 2022 год?",
      "img": "https://upload.wikimedia.org/wikipedia/commons/7/79/Mathematics.png",
      "views": 12587,
      "createdAt": "01.02.1999",
      "userId": "1",
      "type": [
        "SCIENCE"
      ],
      "blocks": [
        {
          "id": "1",
          "type": "TEXT",
          "title": "Заголовок этого блока",
          "paragraphs": [
            "Матема́тика (др.-греч. μᾰθημᾰτικά[1] < μάθημα «изучение; наука») — точная формальная наука[2], первоначально исследовавшая количественные отношения и пространственные формы[3]. В более современном понимании, это наука об отношениях между объектами, о которых ничего не известно, кроме описывающих их некоторых свойств, — именно тех, которые в качестве аксиом положены в основание той или иной математической теории",
            "Математика исторически сложилась на основе операций подсчёта, измерения и описания формы объектов[5]. Математические объекты создаются путём идеализации свойств реальных или других математических объектов и записи этих свойств на формальном языке.",
            "Математика не относится к естественным наукам, но широко используется в них как для точной формулировки их содержания, так и для получения новых результатов. Она является фундаментальной наукой, предоставляющей (общие) языковые средства другим наукам; тем самым она выявляет их структурную взаимосвязь и способствует нахождению самых общих законов природы[6]."
          ]
        }
      ]
    },
    {
      "id": "19",
      "title": "Фи́зика news",
      "subtitle": "Фи́зика",
      "img": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9a/CollageFisica.jpg/274px-CollageFisica.jpg",
      "views": 102145,
      "createdAt": "25.04.1983",
      "userId": "1",
      "type": [
        "SCIENCE"
      ],
      "blocks": [
        {
          "id": "1",
          "type": "TEXT",
          "title": "Заголовок этого блока",
          "paragraphs": [
            "Фи́зика (от др.-греч. φυσική — «природный» от φύσις — «природа») — область естествознания: наука о наиболее общих законах природы, о материи, её структуре, движении и правилах трансформации. Понятия физики и её законы лежат в основе всего естествознания[1][2]. Является точной наукой.",
            "Термин «физика» впервые фигурирует в сочинениях одного из величайших мыслителей древности — Аристотеля (IV век до нашей эры). Первоначально термины «физика» и «философия» были синонимами, так как в основе обеих дисциплин лежало стремление объяснить законы функционирования Вселенной. Однако в результате научной революции XVI века физика развилась в самостоятельную научную отрасль.",
            "В современном мире значение физики чрезвычайно велико. Всё то, чем отличается современное общество от общества прошлых веков, появилось в результате применения на практике физических открытий. Так, исследования в области электромагнетизма привели к появлению телефонов и позже мобильных телефонов, открытия в термодинамике позволили создать автомобиль, развитие электроники привело к появлению компьютеров. Развитие фотоники способно дать возможность создать принципиально новые — фотонные — компьютеры и другую фотонную технику, которые сменят существующую электронную технику. Развитие газодинамики привело к появлению самолётов и вертолётов."
          ]
        }
      ]
    },
    {
      "id": "20",
      "title": "Нало́г news",
      "subtitle": "Нало́г",
      "img": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d7/Philippine-stock-market-board.jpg/250px-Philippine-stock-market-board.jpg",
      "views": 4545,
      "createdAt": "02.08.2020",
      "userId": "1",
      "type": [
        "ECONOMICS"
      ],
      "blocks": [
        {
          "id": "1",
          "type": "TEXT",
          "title": "Заголовок этого блока",
          "paragraphs": [
            "Нало́г — обязательный, индивидуально безвозмездный платёж, взимаемый с организаций и физических лиц в форме отчуждения принадлежащих им на праве собственности средств, в целях финансового обеспечения деятельности государства и муниципальных образований",
            "Налоги следует отличать от сборов (пошлин), взимание которых является условием совершения в отношении их плательщиков определённых действий.",
            "Взимание налогов регулируется налоговым законодательством (см. налоговое право)[2]. Совокупность установленных налогов, а также принципов, форм и методов их установления, изменения, отмены, взимания и контроля образуют налоговую систему государства[5]. Под налогом понимается принудительное изъятие государственными налоговыми структурами денежных средств с физических и юридических лиц, необходимое для осуществления государством своих функций"
          ]
        }
      ]
    },
    {
      "id": "21",
      "title": "Инфля́ция news",
      "subtitle": "Инфля́ция",
      "img": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/14/World_inflation_rate_October_2022.png/282px-World_inflation_rate_October_2022.png",
      "views": 1021,
      "createdAt": "04.04.2003",
      "userId": "1",
      "type": [
        "ECONOMICS"
      ],
      "blocks": [
        {
          "id": "1",
          "type": "TEXT",
          "title": "Заголовок этого блока",
          "paragraphs": [
            "Инфля́ция (с лат. inflatio «вздутие») — устойчивое повышение общего уровня цен на товары и услуги[1]; процесс обесценивания денег, падение их покупательной способности вследствие чрезмерного выпуска (эмиссии) или сокращения товарной массы в обращении при неизменном количестве выпущенных денег",
            "При инфляции цена идентичных товаров со временем увеличивается: на одну и ту же сумму денег по прошествии некоторого времени можно будет купить меньше товаров и услуг, чем прежде[3][4]. По сути, покупательная способность денег снижается, деньги обесцениваются[3][5]. Обесценивание денег приводит к повышению цен в рыночной экономике. В административно-командной системе хозяйствования обесценивание денег может не приводить к изменению цен, но возникает нарастающий товарный дефицит",
            "Инфляцию как длительный, устойчивый процесс следует отличать от разового роста цен (например, из-за денежной реформы или политического события). Инфляция не означает одновременный рост всех цен в экономике, потому что цены на отдельные товары и услуги могут понижаться или оставаться без изменения. Важно, чтобы изменялся общий уровень цен, то есть дефлятор ВВП[3]. Противоположным процессом является дефляция — снижение общего уровня цен."
          ]
        }
      ]
    }
  ],
  "comments": [
    {
      "id": "1",
      "text": "some comment",
      "articleId": "1",
      "userId": "1"
    },
    {
      "id": "2",
      "text": "some comment 2",
      "articleId": "1",
      "userId": "1"
    },
    {
      "id": "3",
      "text": "some comment 3",
      "articleId": "1",
      "userId": "1"
    },
    {
      "articleId": "1",
      "userId": "1",
      "text": "123",
      "id": "4Cljjzl"
    },
    {
      "articleId": "1",
      "userId": "1",
      "text": "some text some text some text",
      "id": "AEM4Dvc"
    },
    {
      "articleId": "1",
      "userId": "2",
      "text": "looooolllooo",
      "id": "IFEOWl0"
    },
    {
      "articleId": "1",
      "userId": "2",
      "text": "привет мир",
      "id": "dBacYRZ"
    },
    {
      "articleId": "1",
      "userId": "2",
      "text": "хехехехе",
      "id": "rBX_C-e"
    },
    {
      "articleId": "1",
      "userId": "2",
      "text": "buuuuuuuuuuuuu",
      "id": "5k0ApX-"
    },
    {
      "articleId": "1",
      "userId": "2",
      "text": "foooooooooooo",
      "id": "w-HDIRq"
    },
    {
      "articleId": "1",
      "userId": "2",
      "text": "mimimiimim",
      "id": "MVvGQoZ"
    },
    {
      "articleId": "3",
      "userId": "1",
      "text": "comment 1",
      "id": "bAs7YBE"
    },
    {
      "articleId": "2",
      "userId": "1",
      "text": "python  kruton",
      "id": "p5rMadd"
    },
    {
      "articleId": "2",
      "userId": "1",
      "text": "123456",
      "id": "bC6tGxz"
    },
    {
      "articleId": "5",
      "userId": "1",
      "text": "kootlin",
      "id": "itIJ8d_"
    },
    {
      "articleId": "13",
      "userId": "2",
      "text": "eeeee",
      "id": "_sa9LZ1"
    },
    {
      "articleId": "18",
      "userId": "2",
      "text": "1111",
      "id": "wie4LW6"
    },
    {
      "articleId": "3",
      "userId": "1",
      "text": "eeee",
      "id": "gBdSaie"
    },
    {
      "articleId": "2",
      "userId": "2",
      "text": "rrrrr",
      "id": "V0TpO1R"
    },
    {
      "articleId": "18",
      "userId": "2",
      "text": "www",
      "id": "iFkf8Rx"
    },
    {
      "articleId": "18",
      "userId": "1",
      "text": "1111",
      "id": "-SDXiK8"
    },
    {
      "articleId": "18",
      "userId": "2",
      "text": "math",
      "id": "2WpZ51_"
    }
  ],
  "users": [
    {
      "id": "1",
      "username": "admin",
      "password": "123",
      "roles": [
        "ADMIN"
      ],
      "features": {
        "isArticleRatingEnabled": true,
        "isCountryEnabled": true,
        "isAppRedesigned": true
      },
      "jsonSettings": {
        "theme": "app_dark_theme",
        "isArticlesPageWasOpened": true
      },
      "avatar": "https://d1y8sb8igg2f8e.cloudfront.net/images/shutterstock_407112565.width-800.jpg"
    },
    {
      "id": "2",
      "username": "user",
      "password": "123",
      "roles": [
        "USER"
      ],
      "features": {
        "isArticleRatingEnabled": true,
        "isCountryEnabled": false
      },
      "jsonSettings": {
        "theme": "app_light_theme",
        "isFirstVisit": true,
        "settingsPageHasBeenOpen": false,
        "isArticlesPageWasOpened": true
      },
      "avatar": "https://xakep.ru/wp-content/uploads/2018/05/171485/KuroiSH-hacker.jpg"
    },
    {
      "id": "3",
      "username": "manager",
      "password": "123",
      "roles": [
        "MANAGER"
      ],
      "features": {
        "isArticleRatingEnabled": false,
        "isCountryEnabled": false
      },
      "jsonSettings": {
        "theme": "app_dark_theme",
        "isFirstVisit": true,
        "settingsPageHasBeenOpen": false,
        "isArticlesPageWasOpened": true
      },
      "avatar": "https://xakep.ru/wp-content/uploads/2018/05/171485/KuroiSH-hacker.jpg"
    },
    {
      "id": "4",
      "username": "testUser",
      "password": "123",
      "roles": [
        "MANAGER"
      ],
      "avatar": ""
    }
  ],
  "profile": [
    {
      "id": "1",
      "first": "IvanN",
      "lastname": "Molotok",
      "age": 465,
      "currency": "EUR",
      "country": "Russia",
      "city": "Moscow",
      "username": "admin",
      "avatar": "https://d1y8sb8igg2f8e.cloudfront.net/images/shutterstock_407112565.width-800.jpg"
    },
    {
      "id": "2",
      "first": "test",
      "lastname": "user",
      "age": 1,
      "currency": "EUR",
      "country": "Russia",
      "city": "Moscow",
      "username": "test",
      "avatar": "https://storage.jewheart.com/content/users/avatars/3746/avatar_3746_500.jpg?1558628223"
    },
    {
      "id": "4",
      "first": "Test",
      "lastname": "User",
      "age": 1,
      "currency": "EUR",
      "country": "Russia",
      "city": "Moscow",
      "username": "Test",
      "avatar": "https://storage.jewheart.com/content/users/avatars/3746/avatar_3746_500.jpg?1558628223"
    }
  ],
  "article-ratings": [
    {
      "id": "1",
      "rate": 4,
      "feedback": "Хорошая статья",
      "userId": "1",
      "articleId": "1"
    },
    {
      "id": "2",
      "rate": 4,
      "feedback": "Хорошая статья",
      "userId": "1",
      "articleId": "2"
    },
    {
      "userId": "1",
      "articleId": "3",
      "rate": 3,
      "feedback": "",
      "id": "6Qr0x1B"
    },
    {
      "userId": "1",
      "articleId": "8",
      "rate": 4,
      "feedback": "norm",
      "id": "ZudLOT4"
    },
    {
      "userId": "1",
      "articleId": "14",
      "rate": 2,
      "id": "mOXAUqp"
    },
    {
      "userId": "1",
      "articleId": "4",
      "rate": 5,
      "feedback": "good",
      "id": "qAl6kpj"
    }
  ],
  "profile-ratings": [
    {
      "id": "1",
      "rate": 4,
      "feedback": "Хорошая статья",
      "userId": "1",
      "profileId": "1"
    },
    {
      "id": "2",
      "rate": 4,
      "feedback": "Хорошая статья",
      "userId": "1",
      "profileId": "2"
    }
  ]
}